using Tyuiu.GolubevDS.Sprint3.Task3.V13.Lib;
DataService ds = new DataService();

Console.WriteLine("**************************************************************************************************************");
Console.WriteLine("* Спринт #3                                                                                                  *");
Console.WriteLine("* Тема: Операции цикла foreach                                                                               *");
Console.WriteLine("* Задание #3                                                                                                 *");
Console.WriteLine("* Вариант #13                                                                                                *");
Console.WriteLine("* Выполнил: Голубев Дмитрий Сергеевич  | ИБКСб-24-1                                                          *");
Console.WriteLine("**************************************************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                                                   *");
Console.WriteLine("* Используя цикл foreach удалить все буквы и знаки препинания, оставить цифру затем преобразовать            *");
Console.WriteLine("* В число в строке: ?sd!! 5gh. s!                                                                            *");
Console.WriteLine("**************************************************************************************************************");
Console.WriteLine("**************************************************************************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                                           *");
Console.WriteLine("**************************************************************************************************************");

string input = "?sd!! 5gh. s!";
int output = ds.ConvertStringToInt(input);
Console.WriteLine($"Результат: {output}"); 