using Tyuiu.GolubevDS.Sprint3.Task4.V22.Lib;
DataService ds = new DataService();

Console.WriteLine("**************************************************************************************************************");
Console.WriteLine("* Спринт #3                                                                                                  *");
Console.WriteLine("* Тема: Операции цикла do while                                                                              *");
Console.WriteLine("* Задание #4                                                                                                 *");
Console.WriteLine("* Вариант #22                                                                                                *");
Console.WriteLine("* Выполнил: Голубев Дмитрий Сергеевич  | ИБКСб-24-1                                                          *");
Console.WriteLine("**************************************************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                                                   *");
Console.WriteLine("* На отрезке, где x принимает значения от -5 до 5, вычислить значение функции y=x/(sin(x) - x)               *");
Console.WriteLine("* При х = 0 пропустить значение. Полученные значения перемножать.                                            *");
Console.WriteLine("**************************************************************************************************************");
Console.WriteLine("**************************************************************************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                                           *");
Console.WriteLine("**************************************************************************************************************");

double result = ds.Calculate(-5, 5);
Console.WriteLine("Результат: " + result);
Console.ReadLine();